Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.57/atdf/PIC32MZ0512EFE064.atdf
      <value-group caption="Primary Oscillator Ready Status bit" name="CLKSTAT__POSCRDY">
         <value caption="Posc is stable and ready" name="" value="0x1"/>
         <value caption="Posc is disabled or not operating" name="" value="0x0"/>
      </value-group>
      <value-group caption="Secondary Oscillator Ready Status bit" name="CLKSTAT__SOSCRDY">
         <value caption="Sosc is stable and ready" name="" value="0x1"/>
         <value caption="Sosc is disabled or not operating" name="" value="0x0"/>
      </value-group>
      <value-group caption="Low-Power RC Oscillator Ready Status bit" name="CLKSTAT__LPRCRDY">
         <value caption="LPRC is stable and ready" name="" value="0x1"/>
         <value caption="LPRC is disabled or not operating" name="" value="0x0"/>
      </value-group>
      <value-group caption="Divided System PLL Ready Status bit" name="CLKSTAT__DIVSPLLRDY">
         <value caption="Divided System PLL is ready" name="" value="0x2"/>
         <value caption="Divided System PLL is not ready" name="" value="0x0"/>
      </value-group>
   </module>
   <module caption="" id="02823" name="RCON" version="2">
      <register-group name="RCON">
         <register caption="Reset Control Register" name="RCON" offset="0x40" rw="RW" size="4">
            <bitfield caption="Power-on Reset Flag bit" mask="0x00000001" name="POR" values="RCON__POR"/>
            <bitfield caption="Brown-out Reset Flag bit" mask="0x00000002" name="BOR" values="RCON__BOR"/>
            <bitfield caption="Wake From Idle Flag bit" mask="0x00000004" name="IDLE" values="RCON__IDLE"/>
            <bitfield caption="Wake From Sleep Flag bit" mask="0x00000008" name="SLEEP" values="RCON__SLEEP"/>
            <bitfield caption="Watchdog Timer Time-out Flag bit" mask="0x00000010" name="WDTO" values="RCON__WDTO"/>
            <bitfield caption="Deadman Timer Time-out Flag bit" mask="0x00000020" name="DMTO" values="RCON__DMTO"/>
            <bitfield caption="Software Reset Flag bit" mask="0x00000040" name="SWR" values="RCON__SWR"/>
            <bitfield caption="External Reset (MCLR) Pin Flag bit" mask="0x00000080" name="EXTR" values="RCON__EXTR"/>
            <bitfield caption="Configuration Mismatch Reset Flag bit" mask="0x00000200" name="CMR" values="RCON__CMR"/>
            <bitfield caption="Primary/Secondary Configuration Registers Error Flag bit" mask="0x04000000" name="BCFGFAIL" values="RCON__BCFGFAIL"/>
            <bitfield caption="Primary Configuration Registers Error Flag bit" mask="0x08000000" name="BCFGERR" values="RCON__BCFGERR"/>
         </register>
         <register caption="Software Reset Register" name="RSWRST" offset="0x50" rw="W" size="4">
            <bitfield caption="Software Reset Trigger bit" mask="0x00000001" name="SWRST" values="RSWRST__SWRST"/>
         </register>
         <register caption="Non-maskable Interrupt (NMI) Control Register" name="RNMICON" offset="0x60" rw="RW" size="4">
            <bitfield caption="NMI Reset Counter Value bits" mask="0x0000FFFF" name="NMICNT" values="RNMICON__NMICNT"/>
            <bitfield caption="Watchdog Timer Time-out in Sleep Mode Flag bit" mask="0x00010000" name="WDTS" values="RNMICON__WDTS"/>
            <bitfield caption="Clock Fail Detect bit" mask="0x00020000" name="CF" values="RNMICON__CF"/>
            <bitfield mask="0x00040000" name="LVD"/>
            <bitfield caption="General NMI bit" mask="0x00080000" name="GNMI" values="RNMICON__GNMI"/>
            <bitfield caption="Software NMI Trigger" mask="0x00800000" name="SWNMI" values="RNMICON__SWNMI"/>
            <bitfield caption="Watchdog Timer Time-Out Flag bit" mask="0x01000000" name="WDTO" values="RNMICON__WDTO"/>
            <bitfield caption="Deadman Timer Time-out Flag bit" mask="0x02000000" name="DMTO" values="RNMICON__DMTO"/>
         </register>
         <register caption="Power Control Register" name="PWRCON" offset="0x70" rw="RW" size="4">
            <bitfield caption="Voltage Regulator Stand-by Enable bit" mask="0x00000001" name="VREGS" values="PWRCON__VREGS"/>
            <bitfield mask="0x00000002" name="RETEN"/>
            <bitfield mask="0x00000004" name="SBOREN"/>
            <bitfield mask="0x00000030" name="VRGSLP"/>
            <bitfield mask="0x000000C0" name="VRGRUN"/>
         </register>
      </register-group>
      <value-group caption="Power-on Reset Flag bit" name="RCON__POR">
         <value caption="Power-on Reset has occurred" name="" value="0x1"/>
         <value caption="Power-on Reset has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Brown-out Reset Flag bit" name="RCON__BOR">
         <value caption="Brown-out Reset has occurred" name="" value="0x1"/>
         <value caption="Brown-out Reset has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Wake From Idle Flag bit" name="RCON__IDLE">
         <value caption="Device was in Idle mode" name="" value="0x1"/>
         <value caption="Device was not in Idle mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Wake From Sleep Flag bit" name="RCON__SLEEP">
         <value caption="Device was in Sleep mode" name="" value="0x1"/>
         <value caption="Device was not in Sleep mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Watchdog Timer Time-out Flag bit" name="RCON__WDTO">
         <value caption="WDT Time-out has occurred" name="" value="0x1"/>
         <value caption="WDT Time-out has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Deadman Timer Time-out Flag bit" name="RCON__DMTO">
         <value caption="A DMT time-out has occurred" name="" value="0x1"/>
         <value caption="A DMT time-out has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Software Reset Flag bit" name="RCON__SWR">
         <value caption="Software Reset was executed" name="" value="0x1"/>
         <value caption="Software Reset was not executed" name="" value="0x0"/>
      </value-group>
      <value-group caption="External Reset (MCLR) Pin Flag bit" name="RCON__EXTR">
         <value caption="Master Clear (pin) Reset has occurred" name="" value="0x1"/>
         <value caption="Master Clear (pin) Reset has not occurred" name="" value="0x0"/>
      </value-group>
