Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.57/atdf/PIC32MZ0512EFE064.atdf
         <register caption="Input Capture x Control Register" name="IC6CON" offset="0xa00" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC6CON__ICM"/>
            <bitfield caption="Input Capture Buffer Not Empty Status bit" mask="0x00000008" name="ICBNE" values="IC6CON__ICBNE"/>
            <bitfield caption="Input Capture Overflow Status Flag bit" mask="0x00000010" name="ICOV" values="IC6CON__ICOV"/>
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC6CON__ICI"/>
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC6CON__ICTMR"/>
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC6CON__C32"/>
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC6CON__FEDGE"/>
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC6CON__SIDL"/>
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC6CON__ON"/>
         </register>
         <register caption="Input Capture x Control Register" name="IC7CON" offset="0xc00" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC7CON__ICM"/>
            <bitfield caption="Input Capture Buffer Not Empty Status bit" mask="0x00000008" name="ICBNE" values="IC7CON__ICBNE"/>
            <bitfield caption="Input Capture Overflow Status Flag bit" mask="0x00000010" name="ICOV" values="IC7CON__ICOV"/>
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC7CON__ICI"/>
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC7CON__ICTMR"/>
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC7CON__C32"/>
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC7CON__FEDGE"/>
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC7CON__SIDL"/>
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC7CON__ON"/>
         </register>
         <register caption="Input Capture x Control Register" name="IC8CON" offset="0xe00" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC8CON__ICM"/>
            <bitfield caption="Input Capture Buffer Not Empty Status bit" mask="0x00000008" name="ICBNE" values="IC8CON__ICBNE"/>
            <bitfield caption="Input Capture Overflow Status Flag bit" mask="0x00000010" name="ICOV" values="IC8CON__ICOV"/>
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC8CON__ICI"/>
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC8CON__ICTMR"/>
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC8CON__C32"/>
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC8CON__FEDGE"/>
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC8CON__SIDL"/>
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC8CON__ON"/>
         </register>
         <register caption="Input Capture x Control Register" name="IC9CON" offset="0x1000" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC9CON__ICM"/>
            <bitfield caption="Input Capture Buffer Not Empty Status bit" mask="0x00000008" name="ICBNE" values="IC9CON__ICBNE"/>
            <bitfield caption="Input Capture Overflow Status Flag bit" mask="0x00000010" name="ICOV" values="IC9CON__ICOV"/>
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC9CON__ICI"/>
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC9CON__ICTMR"/>
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC9CON__C32"/>
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC9CON__FEDGE"/>
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC9CON__SIDL"/>
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC9CON__ON"/>
         </register>
         <register caption="" name="IC1BUF" offset="0x10" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC1BUF"/>
         </register>
         <register caption="" name="IC2BUF" offset="0x210" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC2BUF"/>
         </register>
         <register caption="" name="IC3BUF" offset="0x410" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC3BUF"/>
         </register>
         <register caption="" name="IC4BUF" offset="0x610" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC4BUF"/>
         </register>
         <register caption="" name="IC5BUF" offset="0x810" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC5BUF"/>
         </register>
         <register caption="" name="IC6BUF" offset="0xa10" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC6BUF"/>
         </register>
         <register caption="" name="IC7BUF" offset="0xc10" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC7BUF"/>
         </register>
         <register caption="" name="IC8BUF" offset="0xe10" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC8BUF"/>
         </register>
         <register caption="" name="IC9BUF" offset="0x1010" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC9BUF"/>
         </register>
      </register-group>
