Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.57/atdf/PIC32MZ0512EFE064.atdf
         <register caption="Interrupt Priority Control Registe" name="IPC28" offset="0x300" rw="RW" size="4">
            <bitfield mask="0x00000003" name="U1EIS"/>
            <bitfield mask="0x0000001C" name="U1EIP"/>
            <bitfield mask="0x00000300" name="U1RXIS"/>
            <bitfield mask="0x00001C00" name="U1RXIP"/>
            <bitfield mask="0x00030000" name="U1TXIS"/>
            <bitfield mask="0x001C0000" name="U1TXIP"/>
            <bitfield mask="0x03000000" name="I2C1BIS"/>
            <bitfield mask="0x1C000000" name="I2C1BIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC29" offset="0x310" rw="RW" size="4">
            <bitfield mask="0x00000003" name="I2C1SIS"/>
            <bitfield mask="0x0000001C" name="I2C1SIP"/>
            <bitfield mask="0x00000300" name="I2C1MIS"/>
            <bitfield mask="0x00001C00" name="I2C1MIP"/>
            <bitfield mask="0x00030000" name="CNAIS"/>
            <bitfield mask="0x001C0000" name="CNAIP"/>
            <bitfield mask="0x03000000" name="CNBIS"/>
            <bitfield mask="0x1C000000" name="CNBIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC30" offset="0x320" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CNCIS"/>
            <bitfield mask="0x0000001C" name="CNCIP"/>
            <bitfield mask="0x00000300" name="CNDIS"/>
            <bitfield mask="0x00001C00" name="CNDIP"/>
            <bitfield mask="0x00030000" name="CNEIS"/>
            <bitfield mask="0x001C0000" name="CNEIP"/>
            <bitfield mask="0x03000000" name="CNFIS"/>
            <bitfield mask="0x1C000000" name="CNFIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC31" offset="0x330" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CNGIS"/>
            <bitfield mask="0x0000001C" name="CNGIP"/>
            <bitfield mask="0x00000300" name="CNHIS"/>
            <bitfield mask="0x00001C00" name="CNHIP"/>
            <bitfield mask="0x00030000" name="CNJIS"/>
            <bitfield mask="0x001C0000" name="CNJIP"/>
            <bitfield mask="0x03000000" name="CNKIS"/>
            <bitfield mask="0x1C000000" name="CNKIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC32" offset="0x340" rw="RW" size="4">
            <bitfield mask="0x00000003" name="PMPIS"/>
            <bitfield mask="0x0000001C" name="PMPIP"/>
            <bitfield mask="0x00000300" name="PMPEIS"/>
            <bitfield mask="0x00001C00" name="PMPEIP"/>
            <bitfield mask="0x00030000" name="CMP1IS"/>
            <bitfield mask="0x001C0000" name="CMP1IP"/>
            <bitfield mask="0x03000000" name="CMP2IS"/>
            <bitfield mask="0x1C000000" name="CMP2IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC33" offset="0x350" rw="RW" size="4">
            <bitfield mask="0x00000003" name="USBIS"/>
            <bitfield mask="0x0000001C" name="USBIP"/>
            <bitfield mask="0x00000300" name="USBDMAIS"/>
            <bitfield mask="0x00001C00" name="USBDMAIP"/>
            <bitfield mask="0x00030000" name="DMA0IS"/>
            <bitfield mask="0x001C0000" name="DMA0IP"/>
            <bitfield mask="0x03000000" name="DMA1IS"/>
            <bitfield mask="0x1C000000" name="DMA1IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC34" offset="0x360" rw="RW" size="4">
            <bitfield mask="0x00000003" name="DMA2IS"/>
            <bitfield mask="0x0000001C" name="DMA2IP"/>
            <bitfield mask="0x00000300" name="DMA3IS"/>
            <bitfield mask="0x00001C00" name="DMA3IP"/>
            <bitfield mask="0x00030000" name="DMA4IS"/>
            <bitfield mask="0x001C0000" name="DMA4IP"/>
            <bitfield mask="0x03000000" name="DMA5IS"/>
            <bitfield mask="0x1C000000" name="DMA5IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC35" offset="0x370" rw="RW" size="4">
            <bitfield mask="0x00000003" name="DMA6IS"/>
            <bitfield mask="0x0000001C" name="DMA6IP"/>
            <bitfield mask="0x00000300" name="DMA7IS"/>
            <bitfield mask="0x00001C00" name="DMA7IP"/>
            <bitfield mask="0x00030000" name="SPI2EIS"/>
            <bitfield mask="0x001C0000" name="SPI2EIP"/>
            <bitfield mask="0x03000000" name="SPI2RXIS"/>
            <bitfield mask="0x1C000000" name="SPI2RXIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC36" offset="0x380" rw="RW" size="4">
            <bitfield mask="0x00000003" name="SPI2TXIS"/>
            <bitfield mask="0x0000001C" name="SPI2TXIP"/>
            <bitfield mask="0x00000300" name="U2EIS"/>
            <bitfield mask="0x00001C00" name="U2EIP"/>
            <bitfield mask="0x00030000" name="U2RXIS"/>
            <bitfield mask="0x001C0000" name="U2RXIP"/>
            <bitfield mask="0x03000000" name="U2TXIS"/>
            <bitfield mask="0x1C000000" name="U2TXIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC37" offset="0x390" rw="RW" size="4">
            <bitfield mask="0x00000003" name="I2C2BIS"/>
            <bitfield mask="0x0000001C" name="I2C2BIP"/>
            <bitfield mask="0x00000300" name="I2C2SIS"/>
            <bitfield mask="0x00001C00" name="I2C2SIP"/>
            <bitfield mask="0x00030000" name="I2C2MIS"/>
            <bitfield mask="0x001C0000" name="I2C2MIP"/>
            <bitfield mask="0x03000000" name="CAN1IS"/>
            <bitfield mask="0x1C000000" name="CAN1IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC38" offset="0x3a0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CAN2IS"/>
            <bitfield mask="0x0000001C" name="CAN2IP"/>
            <bitfield mask="0x00000300" name="ETHIS"/>
            <bitfield mask="0x00001C00" name="ETHIP"/>
            <bitfield mask="0x00030000" name="SPI3EIS"/>
            <bitfield mask="0x001C0000" name="SPI3EIP"/>
            <bitfield mask="0x03000000" name="SPI3RXIS"/>
            <bitfield mask="0x1C000000" name="SPI3RXIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC39" offset="0x3b0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="SPI3TXIS"/>
            <bitfield mask="0x0000001C" name="SPI3TXIP"/>
            <bitfield mask="0x00000300" name="U3EIS"/>
            <bitfield mask="0x00001C00" name="U3EIP"/>
            <bitfield mask="0x00030000" name="U3RXIS"/>
            <bitfield mask="0x001C0000" name="U3RXIP"/>
            <bitfield mask="0x03000000" name="U3TXIS"/>
            <bitfield mask="0x1C000000" name="U3TXIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC40" offset="0x3c0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="I2C3BIS"/>
            <bitfield mask="0x0000001C" name="I2C3BIP"/>
            <bitfield mask="0x00000300" name="I2C3SIS"/>
            <bitfield mask="0x00001C00" name="I2C3SIP"/>
            <bitfield mask="0x00030000" name="I2C3MIS"/>
            <bitfield mask="0x001C0000" name="I2C3MIP"/>
            <bitfield mask="0x03000000" name="SPI4EIS"/>
            <bitfield mask="0x1C000000" name="SPI4EIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC41" offset="0x3d0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="SPI4RXIS"/>
            <bitfield mask="0x0000001C" name="SPI4RXIP"/>
            <bitfield mask="0x00000300" name="SPI4TXIS"/>
            <bitfield mask="0x00001C00" name="SPI4TXIP"/>
            <bitfield mask="0x00030000" name="RTCCIS"/>
            <bitfield mask="0x001C0000" name="RTCCIP"/>
            <bitfield mask="0x03000000" name="FCEIS"/>
            <bitfield mask="0x1C000000" name="FCEIP"/>
         </register>
