Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.57/atdf/PIC32MZ0512EFE064.atdf
         <register caption="SPI Status Register" name="SPI1STAT" offset="0x10" rw="RW" size="4">
            <bitfield caption="SPI Receive Buffer Full Status bit" mask="0x00000001" name="SPIRBF" values="SPI1STAT__SPIRBF"/>
            <bitfield caption="SPI Transmit Buffer Full Status bit" mask="0x00000002" name="SPITBF" values="SPI1STAT__SPITBF"/>
            <bitfield caption="SPI Transmit Buffer Empty Status bit" mask="0x00000008" name="SPITBE" values="SPI1STAT__SPITBE"/>
            <bitfield caption="RX FIFO Empty bit (valid only when ENHBUF = 1)" mask="0x00000020" name="SPIRBE" values="SPI1STAT__SPIRBE"/>
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="SPIROV" values="SPI1STAT__SPIROV"/>
            <bitfield caption="Shift Register Empty bit" mask="0x00000080" name="SRMT" values="SPI1STAT__SRMT"/>
            <bitfield caption="Transmit Under Run bit" mask="0x00000100" name="SPITUR" values="SPI1STAT__SPITUR"/>
            <bitfield caption="SPI Activity Status bit" mask="0x00000800" name="SPIBUSY" values="SPI1STAT__SPIBUSY"/>
            <bitfield caption="SPI Frame Error status bit" mask="0x00001000" name="FRMERR" values="SPI1STAT__FRMERR"/>
            <bitfield mask="0x001F0000" name="TXBUFELM"/>
            <bitfield mask="0x1F000000" name="RXBUFELM"/>
         </register>
         <register caption="SPI Status Register" name="SPI2STAT" offset="0x210" rw="RW" size="4">
            <bitfield caption="SPI Receive Buffer Full Status bit" mask="0x00000001" name="SPIRBF" values="SPI2STAT__SPIRBF"/>
            <bitfield caption="SPI Transmit Buffer Full Status bit" mask="0x00000002" name="SPITBF" values="SPI2STAT__SPITBF"/>
            <bitfield caption="SPI Transmit Buffer Empty Status bit" mask="0x00000008" name="SPITBE" values="SPI2STAT__SPITBE"/>
            <bitfield caption="RX FIFO Empty bit (valid only when ENHBUF = 1)" mask="0x00000020" name="SPIRBE" values="SPI2STAT__SPIRBE"/>
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="SPIROV" values="SPI2STAT__SPIROV"/>
            <bitfield caption="Shift Register Empty bit" mask="0x00000080" name="SRMT" values="SPI2STAT__SRMT"/>
            <bitfield caption="Transmit Under Run bit" mask="0x00000100" name="SPITUR" values="SPI2STAT__SPITUR"/>
            <bitfield caption="SPI Activity Status bit" mask="0x00000800" name="SPIBUSY" values="SPI2STAT__SPIBUSY"/>
            <bitfield caption="SPI Frame Error status bit" mask="0x00001000" name="FRMERR" values="SPI2STAT__FRMERR"/>
            <bitfield mask="0x001F0000" name="TXBUFELM"/>
            <bitfield mask="0x1F000000" name="RXBUFELM"/>
         </register>
         <register caption="SPI Status Register" name="SPI3STAT" offset="0x410" rw="RW" size="4">
            <bitfield caption="SPI Receive Buffer Full Status bit" mask="0x00000001" name="SPIRBF" values="SPI3STAT__SPIRBF"/>
            <bitfield caption="SPI Transmit Buffer Full Status bit" mask="0x00000002" name="SPITBF" values="SPI3STAT__SPITBF"/>
            <bitfield caption="SPI Transmit Buffer Empty Status bit" mask="0x00000008" name="SPITBE" values="SPI3STAT__SPITBE"/>
            <bitfield caption="RX FIFO Empty bit (valid only when ENHBUF = 1)" mask="0x00000020" name="SPIRBE" values="SPI3STAT__SPIRBE"/>
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="SPIROV" values="SPI3STAT__SPIROV"/>
            <bitfield caption="Shift Register Empty bit" mask="0x00000080" name="SRMT" values="SPI3STAT__SRMT"/>
            <bitfield caption="Transmit Under Run bit" mask="0x00000100" name="SPITUR" values="SPI3STAT__SPITUR"/>
            <bitfield caption="SPI Activity Status bit" mask="0x00000800" name="SPIBUSY" values="SPI3STAT__SPIBUSY"/>
            <bitfield caption="SPI Frame Error status bit" mask="0x00001000" name="FRMERR" values="SPI3STAT__FRMERR"/>
            <bitfield mask="0x001F0000" name="TXBUFELM"/>
            <bitfield mask="0x1F000000" name="RXBUFELM"/>
         </register>
         <register caption="SPI Status Register" name="SPI4STAT" offset="0x610" rw="RW" size="4">
            <bitfield caption="SPI Receive Buffer Full Status bit" mask="0x00000001" name="SPIRBF" values="SPI4STAT__SPIRBF"/>
            <bitfield caption="SPI Transmit Buffer Full Status bit" mask="0x00000002" name="SPITBF" values="SPI4STAT__SPITBF"/>
            <bitfield caption="SPI Transmit Buffer Empty Status bit" mask="0x00000008" name="SPITBE" values="SPI4STAT__SPITBE"/>
            <bitfield caption="RX FIFO Empty bit (valid only when ENHBUF = 1)" mask="0x00000020" name="SPIRBE" values="SPI4STAT__SPIRBE"/>
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="SPIROV" values="SPI4STAT__SPIROV"/>
            <bitfield caption="Shift Register Empty bit" mask="0x00000080" name="SRMT" values="SPI4STAT__SRMT"/>
            <bitfield caption="Transmit Under Run bit" mask="0x00000100" name="SPITUR" values="SPI4STAT__SPITUR"/>
            <bitfield caption="SPI Activity Status bit" mask="0x00000800" name="SPIBUSY" values="SPI4STAT__SPIBUSY"/>
            <bitfield caption="SPI Frame Error status bit" mask="0x00001000" name="FRMERR" values="SPI4STAT__FRMERR"/>
            <bitfield mask="0x001F0000" name="TXBUFELM"/>
            <bitfield mask="0x1F000000" name="RXBUFELM"/>
         </register>
         <register caption="" name="SPI1BUF" offset="0x20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="SPI1BUF"/>
         </register>
         <register caption="" name="SPI2BUF" offset="0x220" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="SPI2BUF"/>
         </register>
         <register caption="" name="SPI3BUF" offset="0x420" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="SPI3BUF"/>
         </register>
         <register caption="" name="SPI4BUF" offset="0x620" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="SPI4BUF"/>
         </register>
         <register caption="" name="SPI1BRG" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x00001FFF" name="SPI1BRG"/>
         </register>
         <register caption="" name="SPI2BRG" offset="0x230" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="SPI2BRG"/>
         </register>
         <register caption="" name="SPI3BRG" offset="0x430" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="SPI3BRG"/>
         </register>
         <register caption="" name="SPI4BRG" offset="0x630" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="SPI4BRG"/>
         </register>
         <register caption="SPI Control Register 2" name="SPI1CON2" offset="0x40" rw="RW" size="4">
            <bitfield caption="Audio Protocol Mode bit" mask="0x00000003" name="AUDMOD" values="SPI1CON2__AUDMOD"/>
            <bitfield caption="Transmit Audio Data Format bit" mask="0x00000008" name="AUDMONO" values="SPI1CON2__AUDMONO"/>
            <bitfield caption="Enable Audio CODEC Support bit" mask="0x00000080" name="AUDEN" values="SPI1CON2__AUDEN"/>
            <bitfield caption="Ignore Transmit Underrun bit" mask="0x00000100" name="IGNTUR" values="SPI1CON2__IGNTUR"/>
            <bitfield caption="Ignore Receive Overflow bit" mask="0x00000200" name="IGNROV" values="SPI1CON2__IGNROV"/>
            <bitfield caption="Enable Interrupt Events via SPITUR bit" mask="0x00000400" name="SPITUREN" values="SPI1CON2__SPITUREN"/>
            <bitfield caption="Enable Interrupt Events via SPIROV bit" mask="0x00000800" name="SPIROVEN" values="SPI1CON2__SPIROVEN"/>
            <bitfield caption="Enable Interrupt Events via FRMERR bit" mask="0x00001000" name="FRMERREN" values="SPI1CON2__FRMERREN"/>
            <bitfield caption="Sign Extend Read Data from the RX FIFO bit" mask="0x00008000" name="SPISGNEXT" values="SPI1CON2__SPISGNEXT"/>
         </register>
         <register caption="SPI Control Register 2" name="SPI2CON2" offset="0x240" rw="RW" size="4">
            <bitfield caption="Audio Protocol Mode bit" mask="0x00000003" name="AUDMOD" values="SPI2CON2__AUDMOD"/>
            <bitfield caption="Transmit Audio Data Format bit" mask="0x00000008" name="AUDMONO" values="SPI2CON2__AUDMONO"/>
            <bitfield caption="Enable Audio CODEC Support bit" mask="0x00000080" name="AUDEN" values="SPI2CON2__AUDEN"/>
            <bitfield caption="Ignore Transmit Underrun bit" mask="0x00000100" name="IGNTUR" values="SPI2CON2__IGNTUR"/>
            <bitfield caption="Ignore Receive Overflow bit" mask="0x00000200" name="IGNROV" values="SPI2CON2__IGNROV"/>
            <bitfield caption="Enable Interrupt Events via SPITUR bit" mask="0x00000400" name="SPITUREN" values="SPI2CON2__SPITUREN"/>
            <bitfield caption="Enable Interrupt Events via SPIROV bit" mask="0x00000800" name="SPIROVEN" values="SPI2CON2__SPIROVEN"/>
            <bitfield caption="Enable Interrupt Events via FRMERR bit" mask="0x00001000" name="FRMERREN" values="SPI2CON2__FRMERREN"/>
            <bitfield caption="Sign Extend Read Data from the RX FIFO bit" mask="0x00008000" name="SPISGNEXT" values="SPI2CON2__SPISGNEXT"/>
         </register>
         <register caption="SPI Control Register 2" name="SPI3CON2" offset="0x440" rw="RW" size="4">
            <bitfield caption="Audio Protocol Mode bit" mask="0x00000003" name="AUDMOD" values="SPI3CON2__AUDMOD"/>
            <bitfield caption="Transmit Audio Data Format bit" mask="0x00000008" name="AUDMONO" values="SPI3CON2__AUDMONO"/>
            <bitfield caption="Enable Audio CODEC Support bit" mask="0x00000080" name="AUDEN" values="SPI3CON2__AUDEN"/>
            <bitfield caption="Ignore Transmit Underrun bit" mask="0x00000100" name="IGNTUR" values="SPI3CON2__IGNTUR"/>
            <bitfield caption="Ignore Receive Overflow bit" mask="0x00000200" name="IGNROV" values="SPI3CON2__IGNROV"/>
            <bitfield caption="Enable Interrupt Events via SPITUR bit" mask="0x00000400" name="SPITUREN" values="SPI3CON2__SPITUREN"/>
            <bitfield caption="Enable Interrupt Events via SPIROV bit" mask="0x00000800" name="SPIROVEN" values="SPI3CON2__SPIROVEN"/>
            <bitfield caption="Enable Interrupt Events via FRMERR bit" mask="0x00001000" name="FRMERREN" values="SPI3CON2__FRMERREN"/>
            <bitfield caption="Sign Extend Read Data from the RX FIFO bit" mask="0x00008000" name="SPISGNEXT" values="SPI3CON2__SPISGNEXT"/>
         </register>
         <register caption="SPI Control Register 2" name="SPI4CON2" offset="0x640" rw="RW" size="4">
            <bitfield caption="Audio Protocol Mode bit" mask="0x00000003" name="AUDMOD" values="SPI4CON2__AUDMOD"/>
            <bitfield caption="Transmit Audio Data Format bit" mask="0x00000008" name="AUDMONO" values="SPI4CON2__AUDMONO"/>
            <bitfield caption="Enable Audio CODEC Support bit" mask="0x00000080" name="AUDEN" values="SPI4CON2__AUDEN"/>
            <bitfield caption="Ignore Transmit Underrun bit" mask="0x00000100" name="IGNTUR" values="SPI4CON2__IGNTUR"/>
            <bitfield caption="Ignore Receive Overflow bit" mask="0x00000200" name="IGNROV" values="SPI4CON2__IGNROV"/>
            <bitfield caption="Enable Interrupt Events via SPITUR bit" mask="0x00000400" name="SPITUREN" values="SPI4CON2__SPITUREN"/>
            <bitfield caption="Enable Interrupt Events via SPIROV bit" mask="0x00000800" name="SPIROVEN" values="SPI4CON2__SPIROVEN"/>
            <bitfield caption="Enable Interrupt Events via FRMERR bit" mask="0x00001000" name="FRMERREN" values="SPI4CON2__FRMERREN"/>
            <bitfield caption="Sign Extend Read Data from the RX FIFO bit" mask="0x00008000" name="SPISGNEXT" values="SPI4CON2__SPISGNEXT"/>
         </register>
      </register-group>
      <value-group caption="SPI Receive Buffer Full Interrupt Mode bits" name="SPI1CON__SRXISEL">
         <value caption="Interrupt is generated when the buffer is full" name="" value="0x3"/>
         <value caption="Interrupt is generated when the buffer is full by one-half or more" name="" value="0x2"/>
         <value caption="Interrupt is generated when the buffer is not empty" name="" value="0x1"/>
         <value caption="Interrupt is generated when the last word in the receive buffer is read (i.e. buffer is empty)" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Transmit Buffer Empty Interrupt Mode bits" name="SPI1CON__STXISEL">
         <value caption="Interrupt is generated when the buffer is not full (has one or more empty elements)" name="" value="0x3"/>
         <value caption="Interrupt is generated when the buffer is empty by one-half or more" name="" value="0x2"/>
         <value caption="Interrupt is generated when the buffer is completely empty" name="" value="0x1"/>
         <value caption="Interrupt is generated when the last transfer is shifted out of SPISR and transmit operations are complete" name="" value="0x0"/>
      </value-group>
